# pandas join

In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame({'A':[ 1,2,3],
                   'B':[10,20,30]},index = [ 'a' ,'b', 'c'])

In [3]:
df1

   A   B
a  1  10
b  2  20
c  3  30

In [4]:
df2 = pd.DataFrame({'A':[ 4,5,6],
                   'd':[40,50,60]},index = [ 'a' ,'b', 'c'])
df2

   A   d
a  4  40
b  5  50
c  6  60

In [5]:
display(df1,df2)

   A   B
a  1  10
b  2  20
c  3  30

   A   d
a  4  40
b  5  50
c  6  60

In [7]:
df1.join(df2 , lsuffix = '_1')

   A_1   B  A   d
a    1  10  4  40
b    2  20  5  50
c    3  30  6  60